Repository: 84000/data-translation-memory
Catalog: toh151-v2.tmx
Source language: bo
Languages: en

source: དེ་ནས་དེ་དག་དེར་དོང་ནས། སིལ་སྙན་དང་། གླུ་དབྱངས་ཀྱི་སྒྲས་སྦྲན་ཏེ་
en: So they traveled to that spot, announcing themselves with cymbals and song.

source: བཏུད་ནས་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: They bowed down and requested,

source: དབང་བསྐུར་བ་བཞེས་ལ་རྒྱལ་པོར་གྱུར་ཅིག །
en: “Accept the coronation and become our king!”

source: དེས་སྨྲས་པ། ཁོ་བོ་ལྟ་བུ་རྒྱལ་པོའི་འོས་ག་ལ་ཡིན།
en: The poor man objected, “How could it be that someone like me is fit to be king?”

source: དེ་དག་གིས་སྨྲས་པ། བསོད་ནམས་ཀྱི་ལས་ཅན་ཁྱོད།
en: But they responded, “Because you are someone with merit.

source: དེ་སྐད་མ་ཟེར་བར་གདོན་མི་ཟ་བར་རྒྱལ་པོ་བྱ་དགོས་སོ། །སྨྲས་པ།
en: Do not say such things. It is undeniable that you must be king!”

source: དེ་བཞིན་དུ་གྱུར་ཅིག །
en: At that point he agreed.

source: དེ་ནས་དེ་དག་གིས་མལ་གྱི་རྐང་རྟེན་ལ་རྐང་པ་བཞག་པ་དེ་སྟན་བཟང་པོ་ལ་འདུག་ཏུ་བཅུག་ནས། བཀྲ་ཤིས་ཐམས་ཅད་ཀྱིས་རྒྱས་པར་བྱེད་ཅིང་དབང་བསྐུར་ཏེ།
en: They bade him sit down upon the marvelous seat and put his feet on the footrest. With all manner of auspiciousness, they raised him aloft and performed his coronation.

source: དབུ་རྒྱན་དར་ཐོད་ཅན་ལ་སོགས་པའི་རྒྱན་རྣམས་ཀྱིས་བརྒྱན་ནས། ཤིང་རྟའི་མགོ་ལོགས་སུ་གདུགས་ཆེན་པོ་བསྒྲེང་སྟེ།
en: They adorned him with a crown attired with a silk sash and other ornaments, hung a giant parasol over the front of the chariot, and

source: བཙུགས་ཤིང་ཡུ་བ་གསེར་ལས་བྱས་པ། ནོར་བུ་ཅན་གྱི་རྔ་མའི་བསིལ་ཡབ་དག་གིས་གཡོབ་ཅིང་།
en: cooled him with a golden-handled fan with a jeweled tail.

source: ལྷ་རྒྱལ་བར་གྱུར་ཅིག །
en: “Long live the king!

source: རྒྱལ་བར་གྱུར་ཅིག་ཅེས་ཀུན་ནས་མངོན་པར་བསྟོད་དེ། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་དུ་ཁྲིད་དོ། །
en: May he be victorious!” Praises rang out from all sides as they led him to the royal capital.

source: དེ་ནས་རྒྱལ་པོའི་ཤིང་རྟ་དེ་བསྒྱུར་བའི་འཁོར་ལོས་བཀྲེན་པ་ཅིག་ཤོས་གཉིད་ལོག་པའི་མགོ་ཆད་དོ། །
en: At the same time, the spinning wheel of the royal chariot cut off the head of the other beggar, who was lying there fast asleep.

source: དེ་ནས་བསོད་ནམས་ཀྱི་ལས་ཅན་དེ་ཡང་རྒྱལ་སྲིད་ལ་གནས་པར་གྱུར་ཏོ། །
en: From then on, the meritorious man lived as the sovereign. His realm, moreover, was without epidemic or calamity.

source: དེའི་རྒྱལ་སྲིད་དེ་ཡང་། ཡམས་ཀྱི་ནད་དང་། གནོད་པ་མེད་པ་དང་། འབྱོར་པ་དང་། རྒྱས་པ་དང་། བདེ་བ་དང་། ལོ་ལེགས་པ་དང་། སྐྱེ་བོ་དང་། མི་མང་པོས་གང་བར་གྱུར་ཏོ། །
en: It abounded in wealth, development, well-being, and good harvests, and the land was filled with people and other beings.

source: རྒྱལ་པོའི་མིང་གིས་ཡོན་ཏན་ཐམས་ཅད་འབྱོར་ཅིང་ལྡན་པར་གྱུར་ལ།
en: The king’s name became associated with being richly endowed with all positive qualities.

source: དགའ་དགུར་སྤྱོད་པ་དེ་འདི་སྙམ་དུ་འདི་གང་གི་མཐུ་ཡིན།
en: “This prosperity,” the king thought, “is due to someone’s grace.

source: བདག་གི་རྒྱལ་སྲིད་སྐལ་བ་བཟང་པོ་དང་ལྡན་པ་འདི་གང་གིས་བྱུང་བར་གྱུར་སྙམ་པ་དང་། དེ་སངས་རྒྱས་ཀྱི་མཐུས་སྔོན་གྱི་ལས་མངོན་པར་འདུ་བྱས་པ་དེ་ཐམས་ཅད་རྗེས་སུ་དྲན་ནོ། །
en: What is the source of my dominion’s great fortune?” Through the power of the Buddha, he remembered the entire confluence of his previous actions.

source: ཡང་དག་པར་དྲན་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ། བཅོམ་ལྡན་འདས་བདག་ཅག་སེམས་ཅན་མང་པོ་གཞན་རྣམས་ལ་ཐུགས་བརྩེ་བའི་སླད་དུ། ཚུར་གཤེགས་སུ་གསོལ་ཞེས་ཕོ་ཉ་ཞིག་བཏང་ངོ་། །
en: Remembering accurately, he then sent a messenger to the Blessed One bearing the message, “Blessed One, out of compassion for myself and many other beings, please come here!”

source: ཕོ་ཉ་བཏང་ནས་ཀྱང་། རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་གྱི་བར་དང་། རང་གི་ཁྱིམ་གྱི་བར་དུ་བར་དེར་བཅོམ་ལྡན་འདས་ཀྱི་ཐམས་ཅད་དང་ལྡན་པའི་ལམ་ཆག་ཆག་བཏབ་ཅིང་། ཕྱག་དར་བྱས་ཏེ
en: After sending the messenger, he swept and sprinkled water on the entire road from Jeta Grove to his palace on which the Blessed One would travel.

source: མེ་ཏོག་ཆལ་པར་བཀྲམ་ནས། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། རྟ་བབས་བཙུགས་ཤིང་པོག་ཕོར་དག་གིས་བདུགས་ནས་མངོན་པར་བརྒྱན་ཏེ།
en: He also scattered flowers about, lined the way with parasols, victory banners, flags, and porticos, and fumigated it with incense.

source: བཅོམ་ལྡན་འདས་ཀྱང་དེ་ལ་ཐུགས་བརྩེ་བའི་སླད་དུ་གཤེགས་སོ། །
en: Out of compassion, the Blessed One came.

source: དེ་ནས་རྒྱལ་པོ་དེ་གྲོང་ཁྱེར་གྱི་མི་དང་། ཡུལ་མི་དང་བཅས་ཤིང་། བློན་པོ་ཆེན་པོ་དང་། བློན་པོ་དང་། སྒོ་བ་དང་། འཁོར་གྱི་ཚོགས་དང་བཅས་པས་བསུའོ། །
en: He was greeted by the king, townspeople, village folk, high ministers, ministers, guards, and retainers.

source: དེས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མེ་ཏོག་དང་། སྤོས་དང་། མེ་ཏོག་ཕྲེང་དང་། བྱུག་པ་དང་། ཕྱེ་མས་བསྒོས་པའི་སློ་མ་དཔག་ཏུ་མེད་པས་མཆོད་དེ
en: They offered countless baskets filled with flowers, incense, flower garlands, ointments, and aromatic powders before the Blessed One’s feet.

source: དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པའི་ཞབས་ལ་ལུས་ཐམས་ཅད་ཀྱིས་ཕྱག་འཚལ་ནས།
en: They collectively prostrated to the feet of the Blessed One and the assembly of monks.

source: འཁོར་དང་བཅས་ཏེ་བཅོམ་ལྡན་འདས་ལ་བླ་མ་ལ་གུས་པ་དང་།
en: The king and his retinue honored the Blessed One as a spiritual teacher and,

source: གཅེས་པར་བྱེད་པ་ཆེན་པོ་མཆོག་གིས་བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་རང་གི་ཁྱིམ་གྱི་ནང་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ། སྐྱེད་མོས་ཚལ་ཆེན་པོས་ཡོངས་སུ་བསྐོར་བར་གཤེགས་སུ་གསོལ་ནས
en: with the greatest possible admiration, requested the Blessed One and the assembly of monks to come to the palace, which was adorned with all kinds of jewels in the midst of a great park.

source: ཞག་བདུན་དུ་བདེ་བའི་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་རིམ་གྲོ་བྱས་སོ། །
en: For seven days they were honored with all manner of pleasing objects.

source: དེ་ནས་རྒྱལ་པོ་དེས་བཅོམ་ལྡན་འདས་གདུགས་ཚོད་གསོལ་ནས།
en: The king served the Blessed One the midday meal and

source: བསྩང་སྡེར་གྱུ་སྟེ། ཕྱག་བཅབས་པར་རིག་ནས།
en: knew to clean his plate and wash his hands.

source: ཆོས་མཉན་པའི་ཕྱིར་གཡོག་འཁོར་དང་བཅས་པར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་སྟེ།
en: Then, for the purpose of hearing the Dharma, he sat down with his entourage in front of the Blessed One.

source: འདི་སྐད་ཅེས་ཀྱང་གསོལ་ཏོ། །
en: He inquired,

source: བཅོམ་ལྡན་འདས་བདག་ནི་དམའ་བ་དང་། དབུལ་བ་ལགས་ན། བདག་གི་རྒྱལ་སྲིད་ཕུན་སུམ་ཚོགས་པ་འདི་ག་ལས་མཆིས་ལགས།
en: “Blessed One, given that I was once lowly and poor, how is it that I have now gained this bountiful dominion?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Blessed One responded,

source: རྒྱལ་པོ་ཆེན་པོ་མཉན་དུ་ཡོད་པའི་གྲོང་ཁྱེར་ཆེན་པོ་ན། སྦྱིན་བདག་ཆེན་པོ་སྤོབས་པའི་བློ་གྲོས་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: “Great King, in the city of Śrāvastī, there is a sponsor known as Pratibhānamati.

source: དེས་དུས་གཞན་ཞིག་ན་རང་གི་ཁྱིམ་དུ། སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་གདུགས་ཚོད་གསོལ་ཏོ། །
en: Previously, he invited the Buddha and the saṅgha of monks to his home for the midday meal.”

source: དེ་ནས་དེར་སྡུག་བསྔལ་བ་གཉིས་ཤིག་ལྷགས་ཞེས་བྱ་བ་ནས་རྒྱས་པར་སྔ་མ་བཞིན་ཏེ།
en: The Blessed One proceeded to relate the story of how the two anguished people had arrived there and

source: གཅིག་གི་མགོ་ཁྱེད་ཀྱིས་ཤིང་རྟའི་འཁོར་ལོས་ཆོད་པ་ཞེས་བྱ་བའི་བར་དུའོ། །
en: how the chariot’s wheel had sliced off the head of one of them,

source: དེ་ཡང་ཤི་འཕོས་ནས། སེམས་ཅན་དམྱལ་བར་སྐྱེས་ཏེ།
en: who then died and was reborn as a hell being.

source: དེར་སྐྱེས་པ་དེའི་མགོ་སྐད་ཅིག་སྐད་ཅིག་ལ་སྐྱེས་སོ་ཅོག་ན། ལྕགས་ཀྱི་འཁོར་ལོ་འབར་བས་བཅད་དོ། །
en: “In his life there,” the Blessed One said, “his head continuously reappears, only to be cut off again by a flaming iron wheel.

source: དེ་ཡང་དེ་ནས་བསྐལ་པ་བྱེ་བས་ཐར་བར་འགྱུར་རོ། །
en: Only after ten million eons will he be freed from that state.

source: ཁྱོད་ཀྱིས་ནི་རྒྱལ་པོའི་དཔལ་ཐོབ་སྟེ།
en: “You, however, have attained the splendor of kingship

source: བདག་དེ་ལྟ་བུར་གྱུར་ནས། སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ཞག་བདུན་དུ་གདུགས་ཚོད་གསོལ་བར་གྱུར་ཅིག་ཅེས་ཁྱོད་ཀྱིས་སྨོན་ལམ་བཏབ་སྟེ་ཁྱོད་ཀྱི་བསམ་པ་དེ་ཡང་རྫོགས་སོ། །
en: because you made the aspiration, ‘If I were to become a king, I would offer the Buddha and the assembly of monks the midday meal for a full week!’ And thus your intention was fulfilled.

source: དེ་ཕྱིན་ཅད་ནི་ཚེ་རབས་དཔག་ཏུ་མེད་པ་ཐམས་ཅད་དུ་ཕུན་སུམ་ཚོགས་པ་ཆེས་ཁྱད་པར་དུ་འཕགས་པ་དག་འཐོབ་པར་འགྱུར་རོ། །
en: Henceforth, in all your limitless lives, because of your great excellence you will become a distinguished being.”

source: འཇིག་རྟེན་ནག་པོ་འབྱུང་བའི་ཕྱིར། །ཡིད་ནི་དུག་གི་རྩ་བ་ཡིན། །
en: “Because it is the source of evil in the world, The mind is the root of all poison.

source: ཉེས་པར་སྨྲ་རྣམས་འབྱུང་བའི་ཕྱིར། །ཁ་ནི་སྡིག་པའི་སྒོ་ཉིད་དོ། །
en: Because it is the source of negative speech, The mouth is the very gate of evil.

source: སེམས་ཀྱིས་སྣ་ཚོགས་སེམས་པར་བྱེད། །དེ་ནས་ཚིག་ཏུ་སྨྲ་བར་འགྱུར། །
en: “The mind thinks all kinds of things, And what follows is the utterance of words.

source: ངག་ཡིད་དག་གིས་སྡིག་བྱས་པ། །ལུས་སྐྱེས་སྡུག་བསྔལ་སྦྱིན་པར་བྱེད། །
en: The evil that speech and mind create Is born in the body, begetting suffering.

source: ཕན་དང་མི་ཕན་མ་བསམས་པར། །བློ་གྲོས་མེད་པས་སྡིག་བྱེད་པ། །
en: “Without reflecting on benefit or harm, The unintelligent act negatively.

source: དེས་ན་སྡུག་བསྔལ་སྣོད་འགྱུར་ཏེ། །
en: Thus they become vessels of suffering

source: ཉོན་མོངས་པ་དག་དེ་ལྟར་འགྱུར། །
en: And in this way become afflicted.

source: མཁས་པ་རྣམས་ཀྱི་མགོ་བོ་དག །ཡིད་ཀྱིས་གཅོད་པར་འདོད་པ་དེ། །
en: Who in his mind desired to sever The heads of those who are wise.

source: བློ་གྲོས་ངན་པ་མི་ཤེས་པའི། །མགོ་ནི་འཁོར་ལོས་ཡང་དག་ཆོད། །
en: “A wheel cuts off the head Of an ignorant man with poor intellect

source: དཔལ་ལྡན་ཡིད་འདི་ཁོ་ནས་ནི། །ཆོས་དཀར་བདུད་རྩི་རྟེན་པ་ཡི། །
en: “It is by the illustrious mind alone Who are supported by the nectar of the virtuous Dharma

source: སེམས་ཅན་བསོད་ནམས་བྱས་དགེ་རྣམས། །ལྷ་ཡི་འཇིག་རྟེན་རྣམས་སུ་ཁྲིད། །
en: That the virtue created by the merit of beings Leads to the heavenly realms.

source: འདིར་ནི་སྙིང་གིས་ཀུན་བསམས་ནས། །ཚིག་ཏུ་རྗོད་པས་ལེགས་སྨྲས་པ། །
en: “They speak words thoughtful and from the heart, And thus their speech is good.

source: དེ་ཕྱིར་དེ་ནི་ལུས་ཀྱིས་སུ། །བསོད་ནམས་མཛོད་ནི་ལེན་པར་འགྱུར། །
en: It is therefore through their bodies That the treasury of merit is obtained.

source: མི་ཡིས་བློ་ནི་སྔོན་བཏང་སྟེ། །
en: “People who act with forethought

source: ལས་དགེ་མི་དགེ་རྣམས་ཕྱེ་ནས། །
en: Decide between virtue and non-virtue.

source: གལ་ཏེ་བསོད་ནམས་ཆེ་བྱེད་ན། །རྟག་ཏུ་རབ་ཏུ་ལྷ་དེར་འགྱུར། །
en: So, if they engage in great merit, They perennially become the best of gods.

source: སེམས་ཀྱིས་མི་དགེ་བ་ཡི་ལས། །རྟག་ཏུ་ཡོངས་སུ་སྤངས་ནས་ནི། །རབ་ཏུ་དགའ་བས་བསོད་ནམས་ཉིད། །མི་ཡིས་བྱ་སྟེ་སྡིག་པ་མིན། །
en: “When the mind consistently relinquishes Non-virtuous actions, Then people engage in merit with great delight And avoid committing evil.

source: ཚེ་རབས་བྱེ་བ་གྲངས་མེད་པར། །འཁོར་ལོས་སྒྱུར་སོགས་གོ་འཕང་གི། །ལྷ་མིའི་ནང་དུ་རྒྱལ་པོའི་དཔལ། །ཐམས་ཅད་ཐོབ་ནས་ཁྱོད་བཞིན་ནོ། །
en: “Through countless millions of lives as gods or humans They reach the state of the universal monarch And have all the glories of kingship. In doing so they are like you.

source: མི་ཡི་དབང་ཕྱུག་དུས་ཀུན་དུ། །སྲིད་རྣམས་སྙིང་པོ་མེད་ཤེས་ནས། །
en: “Lord of Humans, always bear in mind That existence is without any essence,

source: ཁྱོད་ཀྱིས་སངས་རྒྱས་ཆོས་རྣམས་ལ། །མངོན་པར་བརྩོན་པ་མཐའ་ཡས་བྱ། །
en: And strive ceaselessly In the teachings of the Buddha.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་རྒྱལ་པོ་དེས་ཡང་དག་ཕུལ་གྱི་ཆོས་བསྟན་པ་འདི་ཐོས་ནས།
en: When the king heard this most excellent Dharma teaching from the Buddha,

source: མཆོག་ཏུ་ཡིད་བྱུང་སྟེ། འཁོར་དང་བཅས་པས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་པོ། །
en: he experienced a supreme state of mind and, together with his retinue, attained the result of a stream enterer.

source: གཞན་སྟོང་ཕྲག་མང་པོ་ཞིག་གིས་ནི། བཅོམ་ལྡན་འདས་མཐོང་བ་དང་།
en: Other beings, thousands in number, beheld the Blessed One and heard the Dharma.

source: ཆོས་མཉན་པས་ལྷ་དང་མིའི་ཕུན་སུམ་ཚོགས་པ་རྣམ་པ་སྣ་ཚོགས་ཐོབ་པར་འགྱུར་བ་དང་། ཐར་པའི་ཆ་དང་འཐུན་པའི་དགེ་བའི་རྩ་བ་དག་བསྐྱེད་དོ། །
en: In this way they attained the many pleasures of gods and humans and aroused roots of virtue that accord with freedom.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེར་གང་སེམས་ཅན་རྣམས་ཀྱི་དོན་མཛད་པ་དེ་ཐམས་ཅད་རྒྱས་པར་མཛད་ནས། རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་བྱོན་ཏེ།
en: When the Blessed One had benefited and nurtured everyone present, he departed for Jeta Grove.

source: གཙུག་ལག་ཁང་གི་སྐྱབས་ཤིག་ཏུ། དགེ་སློང་གི་དགེ་འདུན་གྱི་ནང་དུ། སངས་རྒྱས་ཀྱི་གདན་བཤམས་པ་ཉིད་ལ་བཞུགས་ནས།
en: Once back in the monastery, he sat down on the seat arranged for the Buddha in the assembly of monks.

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ།
en: He then spoke to the venerable Ānanda,

source: ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཟུང་ཤིག །ཆོངས་ཤིག །ལྷོགས་ཤིག །གཞན་དག་ལ་ཡང་། རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཅིག །
en: “Ānanda, bear this presentation of the Dharma in mind; memorize it, recite it, and teach it widely!

source: ཀུན་དགའ་བོ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ། །གང་སུ་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་པར་བྱེད་པ། དེ་ཐམས་ཅད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བྱམས་པ་ལས། ཇི་ལྟར་སྨོན་ལམ་བཏབ་པའི་ཐེག་པ་རྣམས་ལ་ལུང་བསྟན་པ་ཐོབ་པར་འགྱུར་རོ། །
en: Ānanda, those noble sons or daughters who uphold this Dharma teaching will receive a prophecy from the thus-gone, worthy, perfect Buddha Maitreya regarding the vehicle that accords with their aspirations.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Venerable Ānanda then asked the Blessed One,

source: བཅོམ་ལྡན་འདས། ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མིང་ཅི་ལགས།
en: “Blessed One, what is the name of this Dharma teaching?

source: ཅི་ལྟར་གཟུང་བར་བགྱི།
en: What should we call it?”

source: ཀུན་དགའ་བོ་དེའི་ཕྱིར། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི། ལས་རྣམ་པར་འབྱེད་པ་བསྟན་པ་ཞེས་བྱ་བར་ཟུང་ཤིག །ཚོང་དཔོན་སྤོབས་པའི་བློ་གྲོས་ཀྱིས་ཞུས་པ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །
en: “Ānanda, you should know this Dharma teaching as The Teaching That Clarifies Karma and The Questions of the Merchant Pratibhānamati.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནསཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། དགེ་སློང་དེ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། ཚོང་དཔོན་སྤོབས་པའི་བློ་གྲོས་གཡོག་འཁོར་དང་བཅས་པ་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ།
en: Then the entire assembly including Venerable Ānanda, the monks, the bodhisattvas, Pratibhānamati and all his servants, along with the world of the gods, humans, asuras, and gandharvas, rejoiced and

source: བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།། །།
en: extolled what the Thus-Gone One had said.

source: འཕགས་པ་སྤོབས་པའི་བློ་གྲོས་ཀྱིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།། །།
en: This completes the noble Great Vehicle sūtra entitled The Questions of Pratibhānamati.

source: རྒྱ་གར་གྱི་མཁན་པོ་པྲཛྙཱ་ཝར་མ་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བན་དེ་ཡེ་ཤེས་སྡེ་ལ་སོགས་པས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།། །
en: This sūtra was translated, edited, and finalized by the Indian preceptor Prajñāvarman, the editor-translator Bandé Yeshé Dé, and others.
